import Page from 'components/Page';
import Typography from 'components/Typography';
import React from 'react';
import { Card, CardBody, CardHeader, Col, Row } from 'reactstrap';

const TypographyPage = () => {
  return (
    <Page
      title="Privacy Policy"
      breadcrumbs={[{ name: 'PrivacyPolicyPage', active: true }]}>
      <Row>
	  <Col>
          <Card>
            <CardHeader>นโยบายข้อมูล</CardHeader>
            <CardBody>
              <Typography type="lead">
			  นโยบายความเป็นส่วนตัวหรือนโยบายคุ้มครองข้อมูลส่วนบุคคลเป็นสัญญาอย่างหนึ่ง โดยมีคู่สัญญาฝ่ายหนึ่งคือผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันซึ่งเป็นผู้เก็บรวบรวม ใช้ เปิดเผยข้อมูลส่วนบุคคลของคู่สัญญาอีกฝ่ายหนึ่งซึ่งเรียกว่าผู้ใช้งานเว็บไซต์หรือแอปพลิเคชันซึ่งเข้ามาใช้บริการในเว็บไซต์หรือแอปพลิเคชันนั้น โดยเนื้อหาในสัญญาจะกล่าวถึงสิทธิและหน้าที่ของคู่สัญญาแต่ละฝ่ายเกี่ยวกับการให้ข้อมูล การเก็บรวบรวมข้อมูล การใช้ข้อมูล รวมถึงการเผยแพร่ข้อมูลของผู้ใช้งานเว็บไซต์หรือแอปพลิเคชัน
              </Typography>
			  <Typography type="lead">
			  โดยที่ข้อมูลส่วนบุคคลของผู้ใช้งาน ได้แก่ ข้อมูลที่สามารถระบุตัวบุคคลซึ่งเป็นเจ้าของข้อมูลนั้นได้ ไม่ว่าจะเป็นข้อมูลส่วนบุคคลทั่วไป เช่น ชื่อ นามสกุล ที่อยู่ วันเดือนปีเกิด เบอร์โทรศัพท์ อายุ วุฒิการศึกษา งานที่ทำ หรือข้อมูลส่วนบุคคลที่มีความอ่อนไหว (Sensitive Data) เช่น เชื้อชาติ เผ่าพันธ์ุ ความคิดเห็นทางการเมือง ความเชื่อ (ลัทธิ ศาสนา ปรัชญา) พฤติกรรมทางเพศ ประวัติอาชญากรรม สุขภาพ ความพิการ พันธุกรรม ข้อมูลชีวภาพ ข้อมูลภาพจำลองใบหน้า ม่านตา หรือลายนิ้วมือ สหภาพแรงงานของผู้ใช้งาน
			  </Typography>
			  <Typography type="lead">
			  ทั้งนี้ ข้อกำหนดเงื่อนไขต่างๆ ที่กำหนดในนโยบายคุ้มครองข้อมูลส่วนบุคคล (เช่น การได้รับความยินยอมจากผู้ใช้งานในการเก็บรวบรวม ใช้ และ/หรือเผยแพร่ข้อมูลส่วนบุคคลของผู้ใช้งาน) จะต้องสอดคล้องและไม่ขัดต่อกฎหมายคุ้มครองข้อมูลส่วนบุคคล ในทางกลับกันอาจกล่าวได้ว่าผู้ให้บริการหรือเจ้าของมักจัดทำนโยบายคุ้มครองข้อมูลส่วนบุคคลเพื่อให้การเก็บรวบรวม ใช้ เปิดเผยข้อมูลนั้นถูกต้องและเป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล
			  </Typography>
			  <Typography type="lead"></Typography>
            </CardBody>
          </Card>
        </Col>

        
      </Row>

      <Row className="mb-3" />

      <Row>
	  <Col>
          <Card>
            <CardHeader>เราเก็บข้อมูลประเภทใดบ้าง</CardHeader>
            <CardBody>
              <Typography type="lead">
			  เราต้องประมวลผลข้อมูลเกี่ยวกับคุณเพื่อนำเสนอผลิตภัณฑ์ในเครือ SaleGoods Chat ประเภทของข้อมูลที่เราเก็บขึ้นอยู่กับวิธีที่คุณใช้ผลิตภัณฑ์ของเรา 
			  คุณสามารถเรียนรู้วิธีการเข้าถึงและลบข้อมูลที่เราเก็บได้โดยเข้าไปที่การตั้งค่า SaleGoods Chat
              </Typography>
            </CardBody>
          </Card>
        </Col>
		</Row>
<Row>
		<Col>
          <Card>
            <CardHeader>สิ่งที่คุณและผู้อื่นดำเนินการและจัดเตรียมให้</CardHeader>
            <CardBody>
              <Typography type="lead">
			   - ข้อมูลและเนื้อหาที่คุณให้ เราเก็บรวบรวมเนื้อหา การสื่อสาร และข้อมูลอื่นๆ ที่คุณให้เมื่อคุณใช้ผลิตภัณฑ์ของเรา รวมถึงเมื่อคุณสมัครใช้งานบัญชีผู้ใช้ สร้างหรือแชร์เนื้อหา และส่งข้อความหรือติดต่อสื่อสารกับคนอื่นๆ เนื้อหา การสื่อสาร และข้อมูลเหล่านี้อาจรวมถึงข้อมูลที่อยู่ในเนื้อหาหรือเกี่ยวกับเนื้อหาที่คุณให้ (เช่น เมตาดาต้า) ตัวอย่างเช่น ตำแหน่งที่ตั้งของรูปภาพหรือวันที่สร้างไฟล์ นอกจากนี้ ยังอาจรวมถึงสิ่งที่คุณเห็นผ่านฟีเจอร์ต่างๆ ที่เราจัดหาให้ เช่น กล้อง เพื่อให้เราสามารถดำเนินการต่างๆ เช่น แนะนำหน้ากากและฟิลเตอร์ที่คุณอาจชอบ หรือให้คำแนะนำในการใช้รูปแบบกล้อง ระบบของเราจะประมวลผลเนื้อหาและการสื่อสารที่คุณและผู้อื่นให้โดยอัตโนมัติเพื่อวิเคราะห์บริบทและเนื้อหาที่อยู่ในข้อมูลดังกล่าวเพื่อวัตถุประสงค์ดังที่อธิบายไว้ด้านล่าง เรียนรู้เพิ่มเติมเกี่ยวกับวิธีการควบคุมว่าใครบ้างที่สามารถเห็นสิ่งที่คุณแชร์ได้
               จากFacebookของคุณ
			  </Typography>
			  <Typography type="lead">
				  - เครือข่ายและการเชื่อมต่อ เราเก็บรวบรวมข้อมูลเกี่ยวกับผู้คน เพจ บัญชีผู้ใช้ แฮชแท็ก และกลุ่มที่คุณเชื่อมต่อด้วย ตลอดจนปฏิสัมพันธ์ของคุณกับสิ่งเหล่านั้นในผลิตภัณฑ์ของเรา เช่น ผู้ที่คุณติดต่อสื่อสารด้วยบ่อยที่สุดหรือกลุ่มที่คุณเป็นสมาชิก นอกจากนี้ เรายังเก็บรวบรวมข้อมูลติดต่อไว้หากคุณเลือกที่จะอัพโหลด ซิงค์ หรือนำเข้าข้อมูลจากอุปกรณ์  ซึ่งเราใช้ในกรณีต่างๆ เช่น ช่วยให้คุณและคนอื่นๆ ค้นหาคนที่คุณอาจจะรู้จักและเพื่อวัตถุประสงค์อื่นๆ ตามที่แสดงไว้ด้านล่างนี้
			  </Typography>
			  <Typography type="lead">
				  - การใช้งานของคุณ เราเก็บรวบรวมข้อมูลเกี่ยวกับวิธีที่คุณใช้ผลิตภัณฑ์ของเรา เช่น ประเภทเนื้อหาที่คุณดูหรือโต้ตอบด้วย ฟีเจอร์ที่คุณใช้ การดำเนินการที่คุณทำ ผู้คนหรือบัญชีผู้ใช้ที่คุณโต้ตอบด้วย รวมทั้งเวลา ความถี่ และระยะเวลาที่คุณทำกิจกรรม ตัวอย่างเช่น เราจะบันทึกเมื่อคุณกำลังใช้ผลิตภัณฑ์ของเราและเมื่อคุณใช้ผลิตภัณฑ์ของเราครั้งล่าสุด และบันทึกว่าคุณดูโพสต์ วิดีโอ และเนื้อหาอื่นๆ ใดบ้างในผลิตภัณฑ์ของเรา 
			  </Typography>
			  <Typography type="lead">
				  - ข้อมูลเกี่ยวกับการทำธุรกรรมในผลิตภัณฑ์ของเรา หากคุณใช้ผลิตภัณฑ์ของเราเพื่อการซื้อหรือธุรกรรมทางการเงินอื่นๆ (เช่น เมื่อคุณทำการบริจาคเงินให้เรา) เราจะเก็บรวบรวมข้อมูลเกี่ยวกับการซื้อหรือธุรกรรมนั้นไว้ ซึ่งรวมถึงข้อมูลการชำระเงิน เช่น ข้อมูลเกี่ยวกับบัญชีผู้ใช้และข้อมูลการยืนยันตัวตน และรายละเอียดเกี่ยวกับการเรียกเก็บเงิน การส่งสินค้า และการติดต่อ
			  </Typography>
			  <Typography type="lead">
			   - สิ่งที่ผู้อื่นทำและข้อมูลที่บุคคลเหล่านั้นให้เกี่ยวกับคุณ นอกจากนี้ เรายังรับและวิเคราะห์เนื้อหา การสื่อสาร และข้อมูลที่ผู้อื่นให้เมื่อบุคคลเหล่านั้นใช้ผลิตภัณฑ์ของเราอีกด้วย ซึ่งอาจรวมถึงข้อมูลเกี่ยวกับคุณ เช่น เมื่อผู้อื่นแชร์หรือแสดงความคิดเห็นบนรูปภาพของคุณ ส่งข้อความหาคุณ หรืออัพโหลด ซิงค์ หรือนำเข้าข้อมูลติดต่อของคุณ
			  </Typography>
            </CardBody>
          </Card>
        </Col>
</Row>

<Row>
		<Col>
          <Card>
            <CardHeader>เราใช้ข้อมูลนี้อย่างไร</CardHeader>
            <CardBody>
              <Typography type="lead">
			  เราใช้ข้อมูลที่เรามี (ตามที่คุณอนุญาต) ตามที่อธิบายไว้ด้านล่าง และเราใช้ข้อมูลในการให้บริการและสนับสนุนผลิตภัณฑ์ SaleGoods Chat รวมถึงบริการที่เกี่ยวข้องตามที่อธิบายไว้ในข้อกำหนดของ SaleGoods Chat โดยวิธีการมีดังนี้
			  
              </Typography>
			  <Typography type="lead">
			  ให้บริการ ปรับแต่ง และปรับปรุงผลิตภัณฑ์ของเรา เราใช้ข้อมูลที่เรามีเพื่อส่งมอบผลิตภัณฑ์ของเรา ซึ่งรวมถึงเพื่อปรับแต่งฟีเจอร์และเนื้อหา ผลิตภัณฑ์ เราจะใช้การเชื่อมต่อ, การตั้งค่า เรียนรู้เพิ่มเติมเกี่ยวกับวิธีที่เราใช้ข้อมูลเกี่ยวกับคุณในการปรับแต่งประสบการณ์ในการใช้ Facebook ของคุณ รวมถึงฟีเจอร์ เนื้อหา และคำแนะนำเกี่ยวกับผลิตภัณฑ์ในเครือ Facebook 
			  </Typography>
			  <Typography type="lead">
			  ข้อมูลระหว่างผลิตภัณฑ์ในเครือ Facebook และอุปกรณ์ต่างๆ: เราเชื่อมโยงข้อมูลเกี่ยวกับกิจกรรมของคุณในผลิตภัณฑ์ในเครือ Facebook และอุปกรณ์ต่างๆ เพื่อมอบประสบการณ์ที่ตรงตามความต้องการและสอดคล้องกันในผลิตภัณฑ์ในเครือ Facebook ทั้งหมดที่คุณใช้ไม่ว่าคุณจะใช้จากที่ใด ตัวอย่างเช่น เราสามารถแนะนำให้คุณเข้าร่วมกลุ่มบน Facebook หรือติดต่อสื่อสารด้วยใน Messenger นอกจากนี้ เรายังสามารถทำให้ประสบการณ์การใช้งานของคุณเป็นไปอย่างราบรื่นมากยิ่งขึ้น เช่น โดยการกรอกข้อมูลการลงทะเบียนของคุณ (เช่น หมายเลขโทรศัพท์มือถือของคุณ) จากผลิตภัณฑ์หนึ่งของ Facebook โดยอัตโนมัติเมื่อคุณสมัครใช้งานบัญชีในผลิตภัณฑ์อื่น
			  </Typography>
			  <Typography type="lead">
				  ในกรณีที่ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันต้องการกำหนดเงื่อนไขการใช้งานเว็บไซต์หรือแอปพลิเคชันโดยละเอียด เช่น ระเบียบ ข้อกำจัดการใช้งาน เงื่อนไขการเป็นสมาชิก เงื่อนไขการขาย หรือให้บริการผ่านเว็บไซต์หรือแอปพลิเคชัน ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันอาจจัดให้มีข้อกำหนดและเงื่อนไขการใช้เว็บไซต์/แอปพลิเคชัน ควบคู่ไปพร้อมกันกับนโยบายความเป็นส่วนตัวนี้ด้วยก็ได้ ในกรณีนี้ข้อกำหนดและเงื่อนไขการใช้เว็บไซต์/แอปพลิเคชันดังกล่าวควรจะสอดคล้องและไม่มีข้อความหรือเงื่อนไขที่ขัดแย้งกัน
			  </Typography>
			  
            </CardBody>
          </Card>
        </Col>

        
      </Row>

      <Row>
	  <Col>
          <Card>
            <CardHeader>ข้อควรคำนึงตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล</CardHeader>
            <CardBody>
              <Typography type="lead">
			  ในกรณีที่ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันมีการเก็บรวบรวม ใช้ หรือเผยแพร่ข้อมูลส่วนบุคคลของผู้ใช้งานตามกฎหมายคุ้มครองข้อมูลส่วนบุคคล ผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันซึ่งเก็บรวบรวม ใช้ และ/หรือเผยแพร่ข้อมูลส่วนบุคลลจะถือว่าเป็น ผู้ควบคุมข้อมูล ซึ่งจะมีหน้าที่ตามกฎหมายดังกล่าว เช่น
              </Typography>
			  <Typography type="lead">
			  ผู้ควบคุมข้อมูลต้องได้รับความยินยอมอย่างชัดแจ้งจากผู้ใช้งานเว็บไซต์หรือแอปพลิเคชันซึ่งเป็นเจ้าของข้อมูลนั้นก่อนจะเก็บรวบรวม ใช้ หรือเผยแพร่ข้อมูลดังกล่าว โดยความยินยอมนั้นจะต้องระบุข้อมูลสำคัญในการขอความยินยอมนั้นด้วย เช่น วัตถุประสงค์การนำข้อมูลไปใช้ ระยะเวลาในการเก็บรวบรวมข้อมูล หน่วยงานที่อาจได้รับการเปิดเผยข้อมูล สิทธิของเจ้าของข้อมูลที่มีต่อผู้ให้บริการเกี่ยวกับข้อมูลส่วนบุคคลที่เก็บรวบรวม ทั้งนี้ ในการให้ความยินยอมของบุคคลที่มีความบกพร่องทางความสามารถ (เช่น ผู้เยาว์ คนไร้ความสามารถ หรือคนเสมือนไร้ความสามารถ) ผู้ใช้อำนาจปกครองบุคคลเหล่านั้นจะต้องเป็นผู้ให้ความยินยอมแทนผู้ใช้งานผู้เป็นเจ้าของข้อมูลด้วย เช่น ผู้ปกครอง ผู้อนุบาล หรือผู้พิทักษ์แล้วแต่กรณีด้วย
			  </Typography>
			  <Typography type="lead">
			  ผู้ควบคุมข้อมูลต้องดำเนินการซึ่งเป็นหน้าที่ต่างๆ ของผู้ควบคุมข้อมูลที่สอดคล้องกับกฎหมายคุ้มครองข้อมูลส่วนบุคคล เช่น จัดให้ผู้ใช้งานเจ้าของข้อมูลสามารถถอนความยินยอมได้ง่ายและได้รับข้อมูลเพียงพอในการถอนความยินยอม การแจ้งข้อมูลผลกระทบสำคัญต่อเจ้าของข้อมูล จัดให้มีวิธี มาตรการ มาตรฐาน หรือระบบเพื่อรักษาความมั่นคงปลอดภัยของข้อมูลที่เหมาะสม จัดให้มีการแก้ไขปรับปรุงข้อมูลให้เป็นปัจจุบันและ/หรือที่ถูกต้อง ลบ ทำลายข้อมูลที่เกินระยะเวลาเก็บรวบรวมหรือที่ไม่เกี่ยวข้อง บันทึกรายการสำคัญเกี่ยวกับการจัดเก็บ การใช้ หรือการเปิดเผยข้อมูลเพื่อการตรวจสอบจากผู้ใช้งานเจ้าของข้อมูลหรือจากหน่วยงานของรัฐ จัดให้มีเจ้าหน้าที่คุ้มครองข้อมูลส่วนบุคคลเพื่อปฏิบัติหน้าที่ตามที่กฎหมายกำหนดในกรณีที่มีการดำเนินกิจกรรมที่เข้าเงื่อนไขของกฎหมายคุ้มครองข้อมูลส่วนบุคคล และหน้าที่อื่นๆ ตามกฎหมายดังกล่าว
			  </Typography>
			  <Typography type="lead">
			  ผู้ควบคุมข้อมูลต้องจัดให้มีการดำเนินการและมีมาตรการของพนักงานผู้ที่มีส่วนเกี่ยวข้องกับการเก็บรวบรวม ใช้ หรือเผยแพร่ข้อมูลเพื่อให้มีการดำเนินการที่สอดคล้องและเป็นไปตามกฎหมายคุ้มครองข้อมูลส่วนบุคคลด้วย
			  </Typography>
			  <Typography type="lead">
			  ในกรณีที่มีการให้ข้อมูลแก่บุคคลอื่น เช่น ผู้ประมวลผลข้อมูลหรือบุคคลภายนอก จะต้องมีมาตรการควบคุมไม่ให้บุคคลอื่นนั้นใช้ข้อมูลที่ไม่เป็นไปตามกฎหมายด้วย และในกรณีที่มีการส่งข้อมูลออกไปนอกประเทศจะต้องมั่นใจว่าผู้รับข้อมูลนั้นมีมาตรการคุ้มครองความปลอดภัยของข้อมูลที่ไม่ด้อยไปกว่ามาตรฐานที่กำหนดในประเทศไทย
			  </Typography>
			  <Typography type="lead">
			  อนึ่ง หากผู้ให้บริการหรือเจ้าของเว็บไซต์หรือแอปพลิเคชันไม่ปฏิบัติตามกฎหมายดังกล่าว อาจมีโทษทั้งทางแพ่ง (เช่น ชดใช้ค่าเสียหายและค่าเสียหายเชิงลงโทษแก่เจ้าของข้อมูลที่ได้รับความเสียหาย) โทษทางอาญา (เช่น จำคุก ปรับ) และโทษทางปกครอง (เช่น สั่งให้ดำเนินการแก้ไข ตักเตือน หรือปรับ)

			  </Typography>
            </CardBody>
          </Card>
        </Col>
		{/* <Col>
          <Card>
            <CardHeader>Text Colors</CardHeader>
            <CardBody>
              <Typography className="text-primary">.text-primary</Typography>
              <Typography className="text-secondary">
                .text-secondary
              </Typography>
              <Typography className="text-success">.text-success</Typography>
              <Typography className="text-danger">.text-danger</Typography>
              <Typography className="text-warning">.text-warning</Typography>
              <Typography className="text-info">.text-info</Typography>
              <Typography className="text-light bg-dark">
                .text-light
              </Typography>
              <Typography className="text-dark">.text-dark</Typography>
              <Typography className="text-muted">.text-muted</Typography>
              <Typography className="text-white bg-dark">
                .text-white
              </Typography>
            </CardBody>
          </Card>
        </Col> */}

        {/* <Col>
          <Card>
            <CardHeader>Inline text elements</CardHeader>
            <CardBody>
              <p>
                You can use the mark tag to <mark>highlight</mark> text.
              </p>
              <p>
                <del>
                  This line of text is meant to be treated as deleted text.
                </del>
              </p>
              <p>
                <s>
                  This line of text is meant to be treated as no longer
                  accurate.
                </s>
              </p>
              <p>
                <ins>
                  This line of text is meant to be treated as an addition to the
                  document.
                </ins>
              </p>
              <p>
                <u>This line of text will render as underlined</u>
              </p>
              <p>
                <small>
                  This line of text is meant to be treated as fine print.
                </small>
              </p>
              <p>
                <strong>This line rendered as bold text.</strong>
              </p>
              <p>
                <em>This line rendered as italicized text.</em>
              </p>
            </CardBody>
          </Card>
        </Col> */}
		{/* <Col>
          <Card>
            <CardHeader>PrivacyPolicyPage</CardHeader>
            <CardBody>
              <Typography type="h1">h1 Heading</Typography>
              <Typography type="h2">h2 Heading</Typography>
              <Typography type="h3">h3 Heading</Typography>
              <Typography type="h4">h4 Heading</Typography>
              <Typography type="h5">h5 Heading</Typography>
              <Typography type="h6">h6 Heading</Typography>
            </CardBody>
          </Card>
        </Col> */}

        {/* <Col>
          <Card>
            <CardHeader>Display</CardHeader>
            <CardBody>
              <Typography type="display-1">Display 1</Typography>
              <Typography type="display-2">Display 2</Typography>
              <Typography type="display-3">Display 3</Typography>
              <Typography type="display-4">Display 4</Typography>
            </CardBody>
          </Card>
        </Col> */}

        {/* <Col>
          <Card>
            <CardHeader>Blockquote</CardHeader>
            <CardBody>
              <Typography type="blockquote">
                Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer
                posuere erat a ante.
              </Typography>
            </CardBody>
          </Card>
        </Col>

        <Col>
          <Card>
            <CardHeader>Lead</CardHeader>
            <CardBody>
              <Typography type="lead">
                Lorem ipsum dolor sit amet, consectetur adipiscing elit. Integer
                posuere erat a ante.
              </Typography>
            </CardBody>
          </Card>
        </Col> */}
      </Row>
    </Page>
  );
};

export default TypographyPage;
